{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a8822320",
   "metadata": {},
   "source": [
    "## Условия задания\n",
    "\n",
    "- Компьютер загадывает целое число от 1 до 100, и нам его нужно угадать. Под «угадать» подразумевается «написать программу, которая угадывает число».\n",
    "- Алгоритм учитывает информацию о том, больше или меньше случайное число нужного нам числа.\n",
    "- Представлен шаблон [baseline](https://colab.research.google.com/drive/1k2WZD8PWWOYFHrpAJoB2eZw06ID7KnFA) из скринкаста.\n",
    "\n",
    "## Метрика качества\n",
    "\n",
    "Результаты оцениваются по среднему количеству попыток при 1000 повторений. Необходимо добиться минимального количества попыток.\n",
    "\n",
    "## Что практикуем\n",
    "\n",
    "- Учимся писать хороший код на Python.\n",
    "- Учимся работать с IDE.\n",
    "- Учимся работать с GitHub.\n",
    "\n",
    "## Критерии оценивания:\n",
    "\n",
    "- 1 балл Программа находит число меньше чем за 20 попыток. Если данное условие не выполняется, выставляется 0 баллов за это и все остальные условия.\n",
    "- 1 балл\tКод решения загружен на GitHub.\n",
    "- 1 балл\tGitHub оформлен соответствующим образом.\n",
    "- 1 балл\tКод соответствует стандарту PEP8.\n",
    "- 1 балл\tКод воспроизводим: зафиксированы версии библиотек в виде файла requirements.txt или иного формата файлов"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4ae86565",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "\n",
    "def random_predict(number: int = 1) -> int:\n",
    "    \"\"\"Угадываем число с помощью бинарного поиска.\n",
    "\n",
    "    Args:\n",
    "        number (int): Загаданное число\n",
    "\n",
    "    Returns:\n",
    "        int: Количество попыток\n",
    "    \"\"\"\n",
    "    count = 0\n",
    "    low = 1\n",
    "    high = 100\n",
    "\n",
    "    while True:\n",
    "        count += 1\n",
    "        predict_number = (low + high) // 2\n",
    "\n",
    "        if predict_number == number:\n",
    "            return count\n",
    "        elif predict_number < number:\n",
    "            low = predict_number + 1\n",
    "        else:\n",
    "            high = predict_number - 1\n",
    "   \n",
    "\n",
    "def score_game(predict) -> int:\n",
    "    count_ls = []\n",
    "    np.random.seed(1)\n",
    "    random_array = np.random.randint(1, 101, size=1000)\n",
    "\n",
    "    for number in random_array:\n",
    "        count_ls.append(predict(number))\n",
    "\n",
    "    score = int(np.mean(count_ls))\n",
    "    print(f\"Ваш алгоритм угадывает число в среднем за: {score} попыток\")\n",
    "    return score\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
